MX1118/STM32freertos/总文件/总文件/智能桌宠全套资料/桌面宠物代码/桌面宠物代码(毅扬专属版本)/HardWare/OLED.c

/***************************************************************************************
  * 本程序由江协科技创建并免费开源共享
  * 你可以任意查看、使用和修改，并应用到自己的项目之中
  * 程序版权归江协科技所有，任何人或组织不得将其据为己有
  * 
  * 程序名称：				0.96寸OLED显示屏驱动程序（4针脚I2C接口）
  * 程序创建时间：			2023.10.24
  * 当前程序版本：			V1.2
  * 当前版本发布时间：		2024.4.24
  * 
  * 江协科技官方网站：		jiangxiekeji.com
  * 江协科技官方淘宝店：	jiangxiekeji.taobao.com
  * 程序介绍及更新动态：	jiangxiekeji.com/tutorial/oled.html
  * 
  * 如果你发现程序中的漏洞或者笔误，可通过邮件向我们反馈：feedback@jiangxiekeji.com
  * 发送邮件之前，你可以先到更新动态页面查看最新程序，如果此问题已经修改，则无需再发邮件
  ***************************************************************************************
  */

#include "stm32f10x.h"
#include "OLED.h"
#include "Delay.h"
#include <string.h>
#include <math.h>
#include <stdio.h>
#include <stdarg.h>

/**
  * 数据存储格式：
  * 纵向8点，高位在下，先从左到右，再从上到下
  * 每一个Bit对应一个像素点
  * 
  *      B0 B0                  B0 B0
  *      B1 B1                  B1 B1
  *      B2 B2                  B2 B2
  *      B3 B3  ------------->  B3 B3 --
  *      B4 B4                  B4 B4  |
  *      B5 B5                  B5 B5  |
  *      B6 B6                  B6 B6  |
  *      B7 B7                  B7 B7  |
  *                                    |
  *  -----------------------------------
  *  |   
  *  |   B0 B0                  B0 B0
  *  |   B1 B1                  B1 B1
  *  |   B2 B2                  B2 B2
  *  --> B3 B3  ------------->  B3 B3
  *      B4 B4                  B4 B4
  *      B5 B5                  B5 B5
  *      B6 B6                  B6 B6
  *      B7 B7                  B7 B7
  * 
  * 坐标轴定义：
  * 左上角为(0, 0)点
  * 横向向右为X轴，取值范围：0~127
  * 纵向向下为Y轴，取值范围：0~63
  * 
  *       0             X轴           127 
  *      .------------------------------->
  *    0 |
  *      |
  *      |
  *      |
  *  Y轴 |
  *      |
  *      |
  *      |
  *   63 |
  *      v
  * 
  */


/*全局变量*********************/

/**
  * OLED显存数组
  * 所有的显示函数，都只是对此显存数组进行读写
  * 随后调用OLED_Update函数或OLED_UpdateArea函数
  * 才会将显存数组的数据发送到OLED硬件，进行显示
  */
uint8_t OLED_DisplayBuf[8][128];

static const uint8_t OLED_InitCmds_SSD1306[] = {
	0xAE,
	0xD5, 0x80,
	0xA8, 0x3F,
	0xD3, 0x00,
	0x40,
	0xA1,
	0xC8,
	0xDA, 0x12,
	0x81, 0xCF,
	0xD9, 0xF1,
	0xDB, 0x30,
	0xA4,
	0xA6,
	0x8D, 0x14,
	0xAF,
};

static const uint8_t OLED_InitCmds_SH1106[] = {
	0xAE,
	0xD5, 0x80,
	0xA8, 0x3F,
	0xD3, 0x00,
	0x40,
	0xAD, 0x8B,
	0xA1,
	0xC8,
	0xDA, 0x12,
	0x81, 0x80,
	0xD9, 0x22,
	0xDB, 0x35,
	0xA4,
	0xA6,
	0xAF,
};

typedef struct
{
	uint8_t Controller;
	uint8_t ColumnOffset;
	const uint8_t *InitCmds;
	uint8_t InitCmdCount;
} OLED_Config;

static const OLED_Config OLED_ConfigTable[] = {
	{OLED_CTRL_SSD1306, 0, OLED_InitCmds_SSD1306, sizeof(OLED_InitCmds_SSD1306)},
	{OLED_CTRL_SH1106, 2, OLED_InitCmds_SH1106, sizeof(OLED_InitCmds_SH1106)},
};

static const OLED_Config *OLED_CurrentConfig = &OLED_ConfigTable[0];

/*********************全局变量*/


/*引脚配置*********************/

static void OLED_I2C_Delay(void)
{
	Delay_us(OLED_I2C_DELAY_US);
}

static void OLED_SelectConfig(void)
{
	uint8_t i;
	OLED_CurrentConfig = &OLED_ConfigTable[0];
	for (i = 0; i < sizeof(OLED_ConfigTable) / sizeof(OLED_ConfigTable[0]); i++)
	{
		if (OLED_ConfigTable[i].Controller == OLED_DEFAULT_CTRL)
		{
			OLED_CurrentConfig = &OLED_ConfigTable[i];
			break;
		}
	}
}

static void OLED_SDA_SetOutput(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
}

static void OLED_SDA_SetInput(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
}

static void OLED_W_SCL(uint8_t BitValue)
{
	GPIO_WriteBit(GPIOB, GPIO_Pin_8, (BitAction)BitValue);
	OLED_I2C_Delay();
}

static void OLED_W_SDA(uint8_t BitValue)
{
	GPIO_WriteBit(GPIOB, GPIO_Pin_9, (BitAction)BitValue);
	OLED_I2C_Delay();
}

static uint8_t OLED_R_SDA(void)
{
	return GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_9);
}

static void OLED_GPIO_Init(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

	GPIO_InitTypeDef GPIO_InitStructure;
 	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
 	GPIO_Init(GPIOB, &GPIO_InitStructure);
	OLED_SDA_SetOutput();

	OLED_W_SCL(1);
	OLED_W_SDA(1);
}

/*********************引脚配置*/


/*通信协议*********************/

static void OLED_I2C_Start(void)
{
	OLED_W_SDA(1);
	OLED_W_SCL(1);
	OLED_W_SDA(0);
	OLED_W_SCL(0);
}

static void OLED_I2C_Stop(void)
{
	OLED_W_SDA(0);
	OLED_W_SCL(1);
	OLED_W_SDA(1);
}

static uint8_t OLED_I2C_WaitAck(void)
{
	uint8_t Ack;
	OLED_SDA_SetInput();
	OLED_W_SDA(1);
	OLED_W_SCL(1);
	Ack = OLED_R_SDA();
	OLED_W_SCL(0);
	OLED_SDA_SetOutput();
	return Ack == 0;
}

static void OLED_I2C_SendByteRaw(uint8_t Byte)
{
	uint8_t i;
	for (i = 0; i < 8; i++)
	{
		OLED_W_SDA(!!(Byte & (0x80 >> i)));
		OLED_W_SCL(1);
		OLED_W_SCL(0);
	}
}

static void OLED_I2C_SkipAck(void)
{
	OLED_W_SDA(1);
	OLED_W_SCL(1);
	OLED_W_SCL(0);
}

static uint8_t OLED_I2C_SendByte(uint8_t Byte)
{
	OLED_I2C_SendByteRaw(Byte);
#if OLED_ENABLE_ACK_CHECK
	return OLED_I2C_WaitAck();
#else
	OLED_I2C_SkipAck();
	return 1;
#endif
}

static void OLED_I2C_BusRecover(void)
{
	uint8_t i;
	OLED_W_SDA(1);
	for (i = 0; i < 9; i++)
	{
		OLED_W_SCL(1);
		OLED_W_SCL(0);
	}
	OLED_I2C_Stop();
}

static uint8_t OLED_WriteCommand(uint8_t Command)
{
	uint8_t Success;
	OLED_I2C_Start();
	Success = OLED_I2C_SendByte((uint8_t)(OLED_I2C_ADDRESS << 1));
	Success &= OLED_I2C_SendByte(0x00);
	Success &= OLED_I2C_SendByte(Command);
	OLED_I2C_Stop();
	return Success;
}

static uint8_t OLED_WriteData(uint8_t *Data, uint8_t Count)
{
	uint8_t i;
	uint8_t Success;
	OLED_I2C_Start();
	Success = OLED_I2C_SendByte((uint8_t)(OLED_I2C_ADDRESS << 1));
	Success &= OLED_I2C_SendByte(0x40);
	for (i = 0; i < Count; i ++)
	{
		OLED_I2C_SendByteRaw(Data[i]);
		OLED_I2C_SkipAck();
	}
	OLED_I2C_Stop();
	return Success;
}

/*********************通信协议*/


/*硬件配置*********************/

static uint8_t OLED_SendInitSequence(void)
{
	uint8_t i;
	uint8_t Success = 1;
	for (i = 0; i < OLED_CurrentConfig->InitCmdCount; i++)
	{
		Success &= OLED_WriteCommand(OLED_CurrentConfig->InitCmds[i]);
		if (!Success)
		{
			break;
		}
	}
	return Success;
}

/**
  * 函    数：OLED初始化
  * 参    数：无
  * 返 回 值：无
  * 说    明：使用前，需要调用此初始化函数
  */
void OLED_Init(void)
{
	uint8_t Retry;
	OLED_SelectConfig();
	OLED_GPIO_Init();
	Delay_ms(OLED_POWER_ON_DELAY_MS);

	for (Retry = 0; Retry < OLED_INIT_RETRY_COUNT; Retry++)
	{
		OLED_I2C_BusRecover();
		if (OLED_SendInitSequence())
		{
			break;
		}
		Delay_ms(5);
	}

